In [1]:
"""
<데이터 분석 과정>
 - 사전 계획 수립(기획) > 데이터 수집 > 데이터 전처리 > 데이터 가공 > 데이터 시각화
   > 인사이트 도출 > 데이터 모델링(머신러닝 or 딥러닝) > 분석 보고서 >웹서비스 개발

<일반 도서에서 정의한 과정>
 - 계획수립 > 데이터 수집 > 데이터 전처리 > 데이터 후처리 > 데이터 분석 > 데이터 시각화
 
"""

'\n<데이터 분석 과정>\n - 사전 계획 수립(기획) > 데이터 수집 > 데이터 전처리 > 데이터 가공 > 데이터 시각화\n   > 인사이트 도출 > 데이터 모델링(머신러닝 or 딥러닝) > 분석 보고서 >웹서비스 개발\n\n<일반 도서에서 정의한 과정>\n - 계획수립 > 데이터 수집 > 데이터 전처리 > 데이터 후처리 > 데이터 분석 > 데이터 시각화\n \n'

In [2]:
"""
<판다스(pandas)>
 - 행렬 데이터를 처리하기 위한 다양한 클래스와 함수를 제공해주는 라이브러리
 - 데이터 분석에서 데이터 처리시에 가장 많이 사용되는 라이브러리임
 - 파일 읽어들이기, 데이터를 파일로 저장하기, 행렬 데이터 전처리 등을 수행
 - 데이터에 대한 시각화도 일부 지원함""
<판다스(pandas)>
 - 행렬 데이터를 처리하기 위한 다양한 클래스와 함수를 제공해주는 라이브러리
 - 데이터 분석에서 데이터 처리시에 가장 많이 사용되는 라이브러리임
 - 파일 읽어들이기, 데이터를 파일로 저장하기, 행렬 데이터 전처리 등을 수행
 - 데이터에 대한 시각화도 일부 지원함
"""

'\n<판다스(pandas)>\n - 행렬 데이터를 처리하기 위한 다양한 클래스와 함수를 제공해주는 라이브러리\n - 데이터 분석에서 데이터 처리시에 가장 많이 사용되는 라이브러리임\n - 파일 읽어들이기, 데이터를 파일로 저장하기, 행렬 데이터 전처리 등을 수행\n - 데이터에 대한 시각화도 일부 지원함""\n<판다스(pandas)>\n - 행렬 데이터를 처리하기 위한 다양한 클래스와 함수를 제공해주는 라이브러리\n - 데이터 분석에서 데이터 처리시에 가장 많이 사용되는 라이브러리임\n - 파일 읽어들이기, 데이터를 파일로 저장하기, 행렬 데이터 전처리 등을 수행\n - 데이터에 대한 시각화도 일부 지원함\n'

### 1. 판다스 라이브러리 불러들이기

In [3]:
### 최초에 한번 불러들이면 됩니다.
# - as : 별칭(라이브러리 이름을 줄여서 사용하고자 할 떄 사용)
# - pandas는 보통 pd라는 별칭을 주로 사용합니다.
import pandas as pd

### 2. 데이터 불러들이기(파일 사용)

In [4]:
"""
<파일 경로 지정 방식>
 * 절대경로
  - 드라이버의 시작 위치부터 모두 작성하는 방식
  - 예시 : C:\pknu_202601\day07_데이터처리_기초\files\sample_1.xlsx

  
 * 상대경로
  - 현재 작업중인 파일(ipynb)의 위치를 기준으로 시작해서 작성하는 방식
  - 현재 위치를 의미하는 기호는 점(.), 폴더로 들어가는 기호는 슬래시(/)를 사용
  - 주로 상대경로를 사용
  - 예시 : ./files/sample_1.xlsx
"""

'\n<파일 경로 지정 방식>\n * 절대경로\n  - 드라이버의 시작 위치부터 모두 작성하는 방식\n  - 예시 : C:\\pknu_202601\\day07_데이터처리_기초\x0ciles\\sample_1.xlsx\n\n  \n * 상대경로\n  - 현재 작업중인 파일(ipynb)의 위치를 기준으로 시작해서 작성하는 방식\n  - 현재 위치를 의미하는 기호는 점(.), 폴더로 들어가는 기호는 슬래시(/)를 사용\n  - 주로 상대경로를 사용\n  - 예시 : ./files/sample_1.xlsx\n'

In [5]:
### 파일 경로 정의
# - 보통 파일 경로는 "상대경로(작업 파일을 기준으로)"를 사용합니다.
file_path = "./files/sample_1.xlsx"

# - 파일 불러들이기(판다스 라이브러리 함수 사용)
# - header : 컬럼명(열제목)이 있는 행번호 지정(파이썬 기준의 순서로 작성, 0부터)
# - usecols : 읽어들일 컬럼의 영역을 지정(엑셀의 ABC... 열 이름 그대로 사용)
# - skipfooter : 행의 가장 하단부터 제외할 행의 갯수 지정
# ** 읽어들인 데이터는 메모리에 저장되며, 주소를 반환해 줍니다.
#    - 반환된 주소는 클래스 주소가 됩니다.
sample_1 = pd.read_excel(file_path,header=1,usecols="A:C",skipfooter=2,)


sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [6]:
### 읽어드린 데이터의 타입 확인하기
# - DataFrame 타입이라고 칭함
# - sample_1은 DataFrame 클래스 메모리 주소를 가지고있음
# - 별도로 클래스를 생성하지 않아도됨(read_excel()함수가 생성해서 주소를 넘겨줍니다.)
type(sample_1)

pandas.core.frame.DataFrame

In [7]:
"""
<DataFrame 클래스>
 - 실제로 행렬 데이터를 관리하는 클래스
 - 판다스에서 사용되는 데이터는 DateFrame 클래스에 담겨져서 사용됨
"""

'\n<DataFrame 클래스>\n - 실제로 행렬 데이터를 관리하는 클래스\n - 판다스에서 사용되는 데이터는 DateFrame 클래스에 담겨져서 사용됨\n'

### 3. 데이터의 기본 정보 확인하기

In [8]:
### 데이터프레임(DataFrame) 클래스 내부에 기본정보를 확인하는 함수(기능)를 제공해줌
# - 매우 중요한 함수 : 숨어있는 정보들이 있음
sample_1.info()

# - RangeIndex : 전체 행의 갯수(행의 시작 인덱스 번호~끝 인데스 번호)
# - Data colums : 총 데이터 컬럼의 갯수
# - Non-Null count : 각 컬럼의 데이터가 존재하는 전체 갯수를 의미(null이 아닌 갯수)
#                  : 비워 있지 않은 갯수를 의미
#                  : ** 매우 중요한 값(결측 데이터가 있는지 확인 가능)
#                  : ** RangeIndex의 갯수 보다 작은 컬럼의 갯수가 있으면
#                        -> 해당 컬럼의 데이터는 처리가 필요하다는 의미임
#                        -> "결측치 데이터가 존재한다"라고 칭함
# - Dtype : 각 열 전체의 타입을 의미함(값 하나하나가 아닌 컬럼 전체의 타입을 의미함)
#         : object(문자열 타입), int(정수열 타입), float(실수형 타입), datetime(날짜형 타입)...(우선순위는 앞에 써준대로임 정수열 타입 값에 하나라도 문
#                                                                                               자열이 있으면 그 데이터는 문자열로 바뀜)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

### 4. 데이터들의 기초 통계 확인하기

In [9]:
sample_1.describe()

### 기초적인 통계 데이터를 제공해줌
# - 단, 숫자(int, float) 타입의 컬럼들에 대해서만 처리가 됨
# - *** 이상한 데이터(이상치 데이터 )확인 가능
#    --> 컬럼의 특성을 알고 있다라는 가정에서 확인 가능
#    --> min과 max의 값을 이용해서 사전에 이상한 데이터 확인 가능
#    --> 사분위수(25%, 75%) 데이터의 계산을 통해서도 이상 데이터 확인 가능

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

### 5. 데이터 조회하기

In [10]:
### head() : 행의 가장 첫번째부터 출력해 줍니다.
# - 기본적으로 항 인덱스 상위 5개를 출력해 줍니다.
# - head()함수에 인자값을 넣지않으면 기본값(default) 5개를 출력
sample_1.head()
sample_1.head(10)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [11]:
### tail() : 가장 마지막 인덱스 행부터 5개를 출력해줌
# - 마지막 행의 인덱스 번호 확인 차원에서 조회
# - 거의 사용되지 않음
sample_1.tail()
sample_1.tail(1)

  국적코드  성별    입국객수
5  A18  여성  232943

In [12]:
### 데이터의 갯수 확인하는 함수를 사용해서도 확인가능
len(sample_1)

6

### 열 데이터 조회하기

In [13]:
sample_1

"""
-------<데이터 조회시 사용하는 메모리 구조 형상>-----------------
{"국적코드" : ["A01", ..."A18"],
 "성별"       ["남성", .."여성"],
 "입국객수"   [106320, ...158912]}

-------<데이터프레임에 저장된 메모리 구조 형상>------------
--- ** 행은 딕셔너리 하나씩을 의미함....
{["국적코드 : "A01", "성별" : "남성", "입국객수" : 106320],
["국적코드 : "A01", "성별" : "여성", "입국객수" : 191436],
..
["국적코드 : "A18", "성별" : "여성", "입국객수" : 232943]}
"""

'\n-------<데이터 조회시 사용하는 메모리 구조 형상>-----------------\n{"국적코드" : ["A01", ..."A18"],\n "성별"       ["남성", .."여성"],\n "입국객수"   [106320, ...158912]}\n\n-------<데이터프레임에 저장된 메모리 구조 형상>------------\n--- ** 행은 딕셔너리 하나씩을 의미함....\n{["국적코드 : "A01", "성별" : "남성", "입국객수" : 106320],\n["국적코드 : "A01", "성별" : "여성", "입국객수" : 191436],\n..\n["국적코드 : "A18", "성별" : "여성", "입국객수" : 232943]}\n'

In [14]:
### 국적코드에 대한 데이터 조회하기
s = sample_1["국적코드"]
# - Series 클래스 타입 : 열을 담당하는 이름(리스트, 튜플과 메모리 구조는 유사함)
print(type(s))
s

<class 'pandas.core.series.Series'>

0    A01
1    A01
2    A31
3    A31
4    A18
5    A18
Name: 국적코드, dtype: object

In [15]:
### 대괄호 2개를 중복하면 행렬단위의 컬럼명이 있는 2차원 데이터로 출력됨
# - 대괄호를 1개만 사용하면 1차원 열단위 데이터만 출력됨
#   (대괄호 1개는 컬럼명 1개만 조회할때 사용됩니다.)

sample_1[["국적코드"]]

  국적코드
0  A01
1  A01
2  A31
3  A31
4  A18
5  A18

In [16]:
### 2개 이상의 컬럼 데이터 조회하기
# 국적코드와 성별 데이터 조회하기
# - 대괄호 2개를 사용해야 합니다.
ss = sample_1[["국적코드", "성별"]]

### 대괄호 2개를 사용하여 조회하는 경우에는 2차원 행렬데이터로 조회되며,
# - 타입은 데이터프레임(DataFrame) 클래스 타입이 됩니다.
print(type(ss))
ss

<class 'pandas.core.frame.DataFrame'>

  국적코드  성별
0  A01  남성
1  A01  여성
2  A31  남성
3  A31  여성
4  A18  남성
5  A18  여성

### 컬럼 단위 데이터 증가 시키기(컬럼 추가)

In [17]:
### 분석에 필요한 컬럼들이 있는 경우 추가 가능
# - "기준년월 "이라는 이름의 컬럼 추가하기(열 데이터 추가하기)
# - 컬럼을 추가하면, 행은 원본의 행갯수만큼 만들어짐
sample_1["기준년월"] = "2019-11"

In [18]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

### 행단위 조회하기 : 행단위 조회는 "필터링" 이라고 칭함

In [19]:
### 행단위 조회 == 필터링 == 조건처림 모둔 같은 의미임
# - 기본 문법에 사용한 조건연산자 및 논리 연산자 사용가능
# - 논리 연산자의 경우에는
#   -> 파이썬 기본 문법에는 and, or을 사용했다면,
#   -> 판다스 데이터 프레임에서는 &, | 기호를 사용함
#   -> 논리 연산자의 왼쪽과 오른쪽 조건들은 모두 소괄호로 묶어야 합니다.

In [20]:
### 성별 데이터에서 여성인 데이터만 추출(조회)하기
# - 행단위 조회 시에는 구분해서 하나하나 확인하면서 코드를 만들어 나갑니다.
# - 1. 열단위 데이터 확인
# - 2. 확인된 열단위 데이터에서 조건 처리

### 조건처리 결과값은 행별로 True or false의 bool타입으로 반환해 줍니다.
condition = sample_1["성별"] == "여성"
condition

### 반환 받은 bool 타입의 열 데이터를 이용해서
# - 실제 원본 데이터에서 "True인 인덱스(index)"만 조회하기
# - True는 생략 가능(기본값이 True로 되어 있)
sample_1[condition == True]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
3  A31  여성      42  2019-11
5  A18  여성  232943  2019-11

In [21]:
### 성별에서 여성이 아닌 데이터만 추출하기
sample_1[condition == False]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [22]:
### 입국객수의 데이터 중에 500이상인 데이터만 조회해 주세요~
# 1. 입국객수의 데이터 열단위 조회
# 2. 조회된 데이터를 기준으로 조건처림

a = sample_1["입국객수"] >= 500


temp_df = sample_1[a == True]
temp_df

### 행과 열 인덱스의 형태***
# - 눈에 보이는 행과 열의 인덱스는 메모리에 저장된 값("인덱스 값")을 의미하며
# - 컴퓨터 메모리에는 실제 행과 열의 "인덱스 번호"를 순차적으로 가지고 있습니다.
# - 행렬 데이터 프레임은 행과 열의 인덱스를 "값"과 "번호"로 관리하며,
#   --> 눈에 보이는 건 "값", 실제 메모리는 순차적인"번호"로 관리 됨

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [23]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    4 non-null      object
 1   성별      4 non-null      object
 2   입국객수    4 non-null      int64
 3   기준년월    4 non-null      object
dtypes: int64(1), object(3)
memory usage: 160.0+ bytes

In [24]:
### 국적코드 데이터 A01인, 국적코드와 성별 데이터 조회하기

# -행단위 처리먼저, 그다음 열단위 처리
# <행단위 처리>
# 1. 국적코드 데이터 중에 A01인 값에 대한 조건(필터링)처리 (bool 데이터)
condition = sample_1["국적코드"] == "A01"

# 2. 조건(True)에 맞는 원본 "전체 데이터(컬럼, 열)" 조회 (DataFram 행렬 데이터)
temp_df = sample_1[condition == True]
temp_df

# <열단위 처리>
# 3. 조건에 맞는 전체 데이터에서 필요한 컬럼만 제시 (DataFrame에서 열 추출하는 방식)
temp_df2 = temp_df[["국적코드","성별"]]
temp_df2

  국적코드  성별
0  A01  남성
1  A01  여성

In [25]:
### 위 1~3단계를 한줄로
sample_1[(sample_1["국적코드"] == "A01") == True][["국적코드","성별"]]

  국적코드  성별
0  A01  남성
1  A01  여성

In [27]:
### 국적코드의 값이 A01이고,
# 입국객수의 값이 150000 이상인,
# 국적코드와 입국객수의 데이터 조회하기

### 조건이 2개 이상 : 논리연산자도 사용해야 합니다.
# - 논리 연산자의 왼쪽/오른쪽 조건들은 소괄호로 묶어야 오류가 안납니다.

# 1. 조건1처리
c1 = sample_1["국적코드"] == "A01"

# 2. 조건2 처리
c2 = sample_1["입국객수"] >= 150000

# 3. 조건1과 조건2를모두 만족하는 전체 데이터 조회
c3 = c1 & c2
temp_df = sample_1[c3 == True]

# <열 단위 조회>
# 4. 전체 데이터에서 필요한 컴럼만 조회
temp_df[["국적코드", "입국객수"]]

  국적코드    입국객수
1  A01  191436

In [32]:
### 위 처리 순서 1~3를 한줄로 합치기

temp_df = sample_1[(sample_1["국적코드"] == "A01") &
         (sample_1["입국객수"] >= 150000) == True][["국적코드", "입국객수"]]
temp_df

  국적코드    입국객수
1  A01  191436

In [41]:
### 국적코드의 값이 A01 또는 A18인
#   국적코드, 입국객수의 데이터 조회하기

n1 = (sample_1["국적코드"] == "A01" ) | (sample_1["국적코드"] == "A18")
 
sample_1[n1][["국적코드","입국객수"]]

  국적코드    입국객수
0  A01  106320
1  A01  191436
4  A18  158912
5  A18  232943

In [44]:
### or 조건인 경우 함수를 이용하여 처리 가능
# - 포함관계의 개념을 적용한 함수 사용
# - 파이썬 기본 문법에서 리스트에 포함되어 있는지 확인하는 in 과 유사한 개념이 존재함
# - isin([])함수 사용
c = sample_1["국적코드"].isin(["A01","A18"])
sample_1[c][["국적코드", "입국객수"]]

  국적코드    입국객수
0  A01  106320
1  A01  191436
4  A18  158912
5  A18  232943

### 6. 외부 데이터(파일 등등) 통합하기

In [ ]:
'''
<데이터 통합 방법>
 - 다른 파일, 즉 외부 파일을 현재 데이터프레임에 행 또는 열 단위로 추가하고자 할 때 사용하는 개념
 - 열 단위 통합 : merge() 함수를 주로 사용함
                : 주로 특정 코드에 대한 실제 이름값을 통합하고자 할 때 사용 됨
                : 원본파일과 외부파일의 데이터에는 동시에 매칭이 가능한 성격의 컬럼값이 있어야함
                
 - 행 단위 통합 : concat() 함수를 주로 사용함
                : 동일한 성격의 데이터들을 행(밑으로) 추가하고자 할 때 주로 사용됨
                : 원본데이터의 열의 갯수와 추가하고자 하는 외부 데이터의 열의 갯수는 같아야 함
                : 참고만 -> 책을 구매할 때 행단위 통합 함수를 append() 함수를 사용하는 책은
                            구매하지 말기(옛날 버전....)
'''

### 데이터 통합 : 컬럼단위 통합하기(옆으로 늘리기)

In [45]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [49]:
### 국적코드에 해당하는 실제 국정명 컬럼을 정의한
# - sample_codemaster.xlsx 파일 읽어들이기
# - 데이터프레임 변수명 : code_master

file_path2 = "./files/sample_codemaster.xlsx"

# 파일 읽어들이기
# - header = 기본값 0을 사용(생략가능)
# - usecols = 데이터가 있는 열 범위 전체 조회시 기본값(전체) 사용(생략 가능)
# - skipfooter = 가장 밑에서부터 생략할 행(없으면 생략)

code_master = pd.read_excel(file_path2)
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [52]:
### 데이터 기본정보 확인하기
code_master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    8 non-null      object
 1   국적명     8 non-null      object
dtypes: object(2)
memory usage: 256.0+ bytes

In [53]:
### 기초통계 확인

code_master.describe()

       국적코드 국적명
count     8   8
unique    8   8
top     A01  일본
freq      1   1

In [54]:
### sample_1을 기준으로 code_code_master의 국정명 컬럼 합치기
# - 합치기 : 의미적을 포함시키기가 맞을 듯....
# - 함수 : 판다스에서 제공하는 merge() 사용 (데이터프레임에서 제공하지 않음)
# - 오른쪽 데이터의 컬럼들 중에 매핑에 사용되지 않은 컬럼들이 왼쪽으로 추가됩니다.

# - left : 원본 데이터프레임 변수명
# - right : 포함할 대상 데이터프레임 변수명

# - how : 어떻게 매핑 할 것인지 정의
#      -> inner : 왼쪽과 오른쪽의 매핑 컬럼의 값이 같은 행에 대해서만 처리함
#      -> left : 왼쪽 데이터는 모두 조회시키되, 오른쪽의 매핑값이 있으면 가지고 오고,
#                                                                없으면 비워 둡니다.
#      -> right : 오른쪽 데이터는 모두 조회시키되, 왼쪽의 매핑값이 있으면 가지고 오고,
#                                                                없으면 비워 둡니다.
#           --> ** 보통 왼쪽 기준으로 작성합니다.

# - left_on : 원본에서 매핑에 사용할 컬럼명
# - right_on : 대상데이터에서 매핑에 사용할 컬럼명
# - 매핑에 사용할 데이터의 성격은 같고 컬럼명이 틀리더라도, 
#    -> 컬럼명은 그대로 사용하면 됩니다.

pd.merge(left = sample_1, 
         right = code_master,
         how = "inner",
         left_on = "국적코드",
         right_on = "국적코드")

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [56]:
temp_df = pd.merge(left = sample_1, 
                     right = code_master,
                     how = "left",
                     left_on = "국적코드",
                     right_on = "국적코드")
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
 3   기준년월    6 non-null      object
 4   국적명     4 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [60]:
temp_df = pd.merge(left = sample_1, 
                     right = code_master,
                     how = "right",
                     left_on = "국적코드",
                     right_on = "국적코드")
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    10 non-null     object
 1   성별      4 non-null      object
 2   입국객수    4 non-null      float64
 3   기준년월    4 non-null      object
 4   국적명     10 non-null     object
dtypes: float64(1), object(4)
memory usage: 528.0+ bytes

In [62]:
### 우리가 사용할 데이터 "Left" 사용
sample_1_code = pd.merge(left = sample_1, 
                     right = code_master,
                     how = "left",
                     left_on = "국적코드",
                     right_on = "국적코드")
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

### 데이터 통합 : 행 단위 통합하기

In [63]:
### 같은 성격의 데이터 + 열의 갯수 동일해야함
# 현재 사용할 마지막 처리된 변수명


sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [82]:
### 통합하기
# 1. 통합에 사용할 데이터 파일 : sample_2.xlsx
# 2. 통합에 사용할 파일 읽어 들이기
#    - 데이터프레임 변수명 : sample_2

# 3. 원본(sample_1_code) 데이터프레임의 컬럼들과 동일하게 데이터 처리
#    - 최종 데이터프레임 변수명 : sample_2_code

# 1.
file_path = "./files/sample_2.xlsx"
# 2.
sample_2 = pd.read_excel(file_path,
                         header=1,
                         usecols="A:C",
                         skipfooter=2)

sample_2["기준년월"] = "2019-12"

# 3.
sample_2_code = pd.merge(left = sample_2,
                         right = code_master, 
                         how = "left",
                         left_on = "국적코드",
                         right_on = "국적코드")

sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [83]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [84]:
### 최종 합치기 전 데이터프레임 변수명
sample_1_code
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [87]:
### 해단위(밑으로) 합치기
# sample_1_code 데이터를 시작을 밑으로
# sample_2_code 데이터를 추가하기
# - 판다스에서 제공하는 concat([데이터프레임1, 데이터프레임2,.....데이터프레임n])함수를 사용
# - ignore_index=True : 데이터를 행단위로 통합시 "인덱스 값" 을 순차적으로 만들기 위한 속성
#                     : 속성을 생략하면 순차적이지 않고, 원본의 "인덱스 값"이 그대로 사용됨
sample = pd.concat([sample_1_code, sample_2_code], ignore_index=True)
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

### 파일로 저장하기

In [89]:
### 데이터프레임 클래스에서 저장하는 멤버함수를 제공합니다.
# - to_xxx()함수 사용

# - 저장할 위치 지정
save_path = "./files/sample.xlsx"

# - 저장하기
# - index=False : 파일 저장시 데이터프레임의 "행 인덱스 값"은 제외 시키기
sample.to_excel(save_path, index=False)